### Terraform Plan Result - ✅ Plan Succeeded
 
### 🟢 예상 월 비용: $0

<details>
<summary>비용 상세 보기 (클릭)</summary>

```
Project: jiwonseok97/prowler_GitHub-Actions/tmp/tmp.l5b7Awyn1B/plan.json
Module path: /tmp/tmp.l5b7Awyn1B/plan.json

Errors:
  Error sending API request:
    Post "https://pricing.api.infracost.io/graphql":
      POST https://pricing.api.infracost.io/graphql giving up after 5 attempt(s)

──────────────────────────────────
Project: jiwonseok97/prowler_GitHub-Actions

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

 OVERALL TOTAL                           $0.00 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
1 cloud resource was detected:
∙ 0 were estimated
∙ 1 is not supported yet, rerun with --show-skipped to see details

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                                         ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ jiwonseok97/prowler_GitHub-Actions/tmp/tmp.l5b7Awyn1B/plan.json ┃         $0.00 ┃           - ┃      $0.00 ┃
┃ jiwonseok97/prowler_GitHub-Actions                              ┃         $0.00 ┃           - ┃      $0.00 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```

</details>

 <details>
 <summary>Plan 상세 보기 (클릭)</summary>

 ```
 ## Category: config
  Files: 1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.31.0...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[32m[1mSuccess![0m The configuration is valid.
[0m
Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_region.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_caller_identity.current: Read complete after 0s [id=132410971304]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_config_configuration_recorder.remediation_config_recorder will be created
  + resource "aws_config_configuration_recorder" "remediation_config_recorder" {
      + id       = (known after apply)
      + name     = "remediation-config-recorder"
      + region   = "ap-northeast-2"
      + role_arn = (known after apply)

      + recording_group {
          + all_supported                 = true
          + include_global_resource_types = true
        }
    }

  # aws_iam_role.remediation_config_recorder_role will be created
  + resource "aws_iam_role" "remediation_config_recorder_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "remediation-config-recorder-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.remediation_config_recorder_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "remediation_config_recorder_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSConfigRole"
      + role       = "remediation-config-recorder-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"
2026-02-10T08:16:13Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2026-02-10T08:16:13Z INFO Found Terraform plan JSON file project "-tmp-tmp.l5b7Awyn1B-plan.json" at directory "/tmp/tmp.l5b7Awyn1B/plan.json"

2026-02-10T08:16:29Z INFO Output saved to /tmp/infracost-config.json
## Category: fms
  Files: 1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.31.0...
- Installed hashicorp/aws v6.31.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[32m[1mSuccess![0m The configuration is valid.
[0m
Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_caller_identity.current: Read complete after 0s [id=132410971304]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_fms_policy.remediation_example will be created
  + resource "aws_fms_policy" "remediation_example" {
      + arn                                = (known after apply)
      + delete_all_policy_resources        = true
      + delete_unused_fm_managed_resources = false
      + exclude_resource_tags              = false
      + id                                 = (known after apply)
      + name                               = "org-mandatory-policy"
      + policy_update_token                = (known after apply)
      + region                             = "ap-northeast-2"
      + remediation_enabled                = true
      + resource_set_ids                   = (known after apply)
      + resource_tag_logical_operator      = (known after apply)
      + resource_type                      = "AWS::ElasticLoadBalancingV2::LoadBalancer"
      + resource_type_list                 = (known after apply)
      + tags_all                           = (known after apply)

      + security_service_policy_data {
          + managed_service_data = jsonencode(
                {
                  + type = "WAFV2"
                }
            )
          + type                 = "WAFV2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"
2026-02-10T08:17:03Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2026-02-10T08:17:03Z INFO Found Terraform plan JSON file project "-tmp-tmp.dCox6ojVKT-plan.json" at directory "/tmp/tmp.dCox6ojVKT/plan.json"
2026-02-10T08:17:03Z INFO Output saved to /tmp/infracost-fms.json

 ```

 </details>

 > 💡 이 PR을 머지하면 위 리소스가 AWS에 자동 적용됩니다.